Can't paste current clipboard contents in [View Type] View. Switch to appropriate view to paste.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotPasteInView { get; }
  Visual Basic
Public Shared ReadOnly Property CannotPasteInView As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotPasteInView {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures CopyPasteFailures Class
  Autodesk.Revit.DB Namespace